use school_roll;
insert into course
  values ("高数",6,"必修","大一"),
  ("大英",4,"必修","大一"),
  ("计算机导论",4,"必修","大一"),
  ("大学物理",4,"必修","大一"),
  ("思修",6,"必修","大一"),
  ("高数2",6,"必修","大一");

insert into course
  values ("程序分析",6,"必修","大三"),
  ("数据库应用",6,"必修","大三"),
  ("程序测试",6,"必修","大三"),
  ("软件建模",6,"必修","大三"),
  ("系统分析",6,"必修","大三"),
  ("软工经济",6,"必修","大三");

insert into course
  values ("界面设计",6,"任选","任意"),
  ("人机交互",6,"任选","任意"),
  ("人力资源",6,"任选","任意"),
  ("社会史",6,"任选","任意"),
  ("数模",6,"限选","任意"),
  ("acm",6,"限选","任意"),
  ("物联网",6,"限选","任意");
