insert into student
  values(15130110071,"范中豪",1513011,"男","在校",2015),
  (15130110072,"王洋",1513011,"男","在校",2015),
  (15130110076,"吴家明",1513011,"男","在校",2015);

insert into student
  values(15130141234,"李白",1513014,"男","在校",2015),
  (15130141233,"小红",1513014,"女","在校",2015);

insert into student
  values(15010110001,"李华",1501011,"男","开除",2015),
  (15010110002,"韩梅梅",1501011,"女","开除",2015);

insert into student
  values(14130110012,"小刚",1413011,"男","开除",2014),
  (14130110036,"小白",1413011,"女","在校",2014);
