use school_roll;
insert into opcourse
  values (15130110071,"界面设计"),
  (15130110071,"人机交互"),
  (15130110071,"人力资源"),
  (15130110071,"社会史"),
  (15130110071,"数模"),
  (15130110071,"物联网");

insert into opcourse
  values (15130110072,"界面设计"),
  (15130110072,"人机交互"),
  (15130110072,"人力资源"),
  (15130110072,"社会史"),
  (15130110072,"数模"),
  (15130110072,"acm");

insert into opcourse
  values (15130110076,"界面设计"),
  (15130110076,"人机交互"),
  (15130110076,"人力资源"),
  (15130110076,"社会史"),
  (15130110076,"acm"),
  (15130110076,"物联网");

insert into opcourse
  values (15130141233,"界面设计"),
  (15130141233,"人机交互"),
  (15130141233,"人力资源"),
  (15130141233,"社会史"),
  (15130141233,"数模"),
  (15130141233,"物联网");

insert into opcourse
  values (15130141234,"界面设计"),
  (15130141234,"人机交互"),
  (15130141234,"人力资源"),
  (15130141234,"社会史"),
  (15130141234,"acm"),
  (15130141234,"数模");

insert into opcourse
  values (15010110002,"界面设计"),
  (15010110002,"acm"),
  (15010110002,"数模"),
  (15010110002,"社会史");

insert into opcourse
  values (15010110001,"界面设计"),
  (15010110001,"acm"),
  (15010110001,"数模"),
  (15010110001,"物联网");

insert into opcourse
  values (14130110036,"界面设计"),
  (14130110036,"acm"),
  (14130110036,"数模"),
  (14130110036,"物联网");

insert into opcourse
  values (14130110012,"界面设计"),
  (14130110012,"acm"),
  (14130110012,"数模"),
  (14130110012,"物联网");
