use school_roll;
insert into teacher
  values (1,"李慧婵","高数",1513011,"软件工程"),
  (2,"马琪","大英",1513011,"软件工程"),
  (3,"刘惠","计算机导论",1513011,"软件工程"),
  (4,"魏群","大学物理",1513011,"软件工程"),
  (5,"李莹","思修",1513011,"软件工程"),
  (1,"李慧婵","高数2",1513011,"软件工程");

  insert into teacher
    values (1,"李慧婵","高数",1513014,"软件工程"),
    (2,"马琪","大英",1513014,"软件工程"),
    (3,"刘惠","计算机导论",1513014,"软件工程"),
    (4,"魏群","大学物理",1513014,"软件工程"),
    (5,"李莹","思修",1513014,"软件工程"),
    (1,"李慧婵","高数2",1513014,"软件工程");

  insert into teacher
    values (1,"李慧婵","高数",1501011,"软件工程"),
    (2,"马琪","大英",1501011,"软件工程"),
    (3,"刘惠","计算机导论",1501011,"软件工程"),
    (4,"魏群","大学物理",1501011,"软件工程"),
    (5,"李莹","思修",1501011,"软件工程"),
    (1,"李慧婵","高数2",1501011,"软件工程");

/*  insert into teacher
    values (1,"李慧婵","高数",1413011,"软件工程"),
    (2,"马琪","大英",1413011,"软件工程"),
    (3,"刘惠","计算机导论",1413011,"软件工程"),
    (4,"魏群","大学物理",1413011,"软件工程"),
    (5,"李莹","思修",1413011,"软件工程"),
    (1,"李慧婵","高数2",1413011,"软件工程");
*/
  insert into teacher
    values (6,"邹","程序分析",1413011,"软件工程"),
    (7,"李","数据库应用",1413011,"软件工程"),
    (8,"吴","程序测试",1413011,"软件工程"),
    (9,"郑","软件建模",1413011,"软件工程"),
    (10,"王","系统分析",1413011,"软件工程"),
    (11,"周","软工经济",1413011,"软件工程");

  insert into teacher
    values(12,"孙","界面设计",0,"软件工程"),
    (13,"杨","人机交互",0,"软件工程"),
    (14,"成","人力资源",0,"软件工程"),
    (15,"陈","社会史",0,"软件工程"),
    (16,"刘","数模",0,"软件工程"),
    (17,"谭","acm",0,"软件工程"),
    (18,"张","物联网",0,"软件工程");
